[
    {
        "image-url": "",
        "caption": "<strong>December 1977</strong>. Booter David Pons attempts to out maneuver his guard as Ike Monserrat comes tot he rescue. This bit of action was taken in their recent game against Trinity College, where they practically toyed around the Stallions before ending the game at 15-0. The tteam is out to establish an unprecedented eight straight crown."
    },
    {
        "image-url": "",
        "caption": "<strong>October 1977</strong>. Who do we play for? La Salle or the club teams? The question often bugs our skilled footballers who are now affected by an NCAA ruling on eligilibility. One thing, club teams offer green pastures."
    },
    {
        "image-url": "",
        "caption": "<strong>October 1977</strong>. GOLI KA NA BA PARE? Heavy rains penetrated the roof fronting the gym last month."
    },
    {
        "image-url": "",
        "caption": "<strong>December 1979</strong>. CANTEEN BOYCOTTS STUDENTS! The Canteen closed its doors last December 5, 1979, from 1:15pm to 4:00pm, at the height of the CORE-CANTEEN crisis."
    },
    {
        "image-url": "",
        "caption": "<strong>December 1979</strong>. Members of the Chorale sing their hearts out in their concert entitled Rock, Rythm, and Romance Reverberate on Campus at the Meralco Theatre "
    },
    {
        "image-url": "",
        "caption": "<strong>January 1980</strong>. A NEW PARKING LOT? MMTC Bus No. 159 rammed intot he main driveway of La Salle, toppling down one pine tree."
    },
    {
        "image-url": "",
        "caption": "<strong>July 1980</strong>. THE MAN BEHIND THE TRIMESTER PLAN: Dr. Paulino Y. Tan, Vice President for Academic Affairs. A thorough study is needed, he reiterates."
    },
    {
        "image-url": "",
        "caption": "<strong>March 1986</strong>. Rustans. Our very own."
    },
    {
        "image-url": "",
        "caption": "<strong>December 1987</strong>. Christmas concert. The DLSU band stages a Christmas presentation entitled Ang Pasko at the William Shaw Theatre recently."
    }
]